# Manual Python

This manual has its main goal to learn how to use Python.

## Open library and import data set

The first step, is to import panda as pd, like the next code:

In [2]:
import pandas as pd

In [3]:
dg = pd.read_excel("Base_Pepa.xlsx")

In [6]:
dg

     Grecia  Canada       Fuente    Score
0         1       3  Se mantiene  1705.76
1         1       1      Mas uno  1340.24
2         1       1      Mas uno  1720.99
3         1       1      Mas uno  1264.09
4         1       1      Mas uno   959.49
..      ...     ...          ...      ...
495       2       2      Mas uno  1203.17
496       1       3  Se mantiene  1660.07
497       1       3  Se mantiene  1675.30
498       1       1      Mas uno  1644.84
499       1       1      Mas uno  1812.37

[500 rows x 4 columns]

In [5]:
dg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Grecia  500 non-null    int64
 1   Canada  500 non-null    int64
 2   Fuente  500 non-null    object
 3   Score   500 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 15.8+ KB

## Columns

To get information about the columns of a DataFrame, run the following code

In [6]:
nombres = dg.columns
nombres

Index(['Grecia', 'Canada', 'Fuente', 'Score'], dtype='object')

### Drop variables

In [7]:
dg.drop(columns=["Canada"])

     Grecia       Fuente    Score
0         1  Se mantiene  1705.76
1         1      Mas uno  1340.24
2         1      Mas uno  1720.99
3         1      Mas uno  1264.09
4         1      Mas uno   959.49
..      ...          ...      ...
495       2      Mas uno  1203.17
496       1  Se mantiene  1660.07
497       1  Se mantiene  1675.30
498       1      Mas uno  1644.84
499       1      Mas uno  1812.37

[500 rows x 3 columns]

### Transpose matrix

In [8]:
ap = dg.T

In [9]:
ap

,0,1,2,3,4,5,6,7,8,9,...,490,491,492,493,494,495,496,497,498,499
Grecia,1,1,1,1,1,1,2,2,1,1,...,1,1,1,1,1,2,1,1,1,1
Canada,3,1,1,1,1,1,1,1,1,3,...,1,2,1,1,3,2,3,3,1,1
Fuente,Se mantiene,Mas uno,Mas uno,Mas uno,Mas uno,Mas uno,Suma Dos,Suma Dos,Mas uno,Se mantiene,...,Mas uno,Se mantiene,Mas uno,Mas uno,Se mantiene,Mas uno,Se mantiene,Se mantiene,Mas uno,Mas uno
Score,1705.76,1340.24,1720.99,1264.09,959.49,1081.33,1842.83,1736.22,1538.23,1203.17,...,1705.76,1858.06,1644.84,1644.84,1644.84,1203.17,1660.07,1675.3,1644.84,1812.37

## Data Manipulation: Pag  91

## Select multiple columns

In [5]:
jh = dg.loc[:, ["Grecia", "Score"]]

In [7]:
print(jh.head())

   Grecia    Score
0       1  1705.76
1       1  1340.24
2       1  1720.99
3       1  1264.09
4       1   959.49

## Select a specific range of rows

It is important to remember that Python uses zero-based indexing, meaning it starts counting from zero.

In [8]:
GH = dg.loc[[3, 4], :]

In [9]:
GH

   Grecia  Canada   Fuente    Score
3       1       1  Mas uno  1264.09
4       1       1  Mas uno   959.49

## Setting Data: Pag 97

To replace a value from another, I should apply the following code:

When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

In [7]:
dg2 = dg.copy()

In [9]:
dg2.loc[0, "Fuente"] = "Unidos"

In [10]:
dg2.head()

   Grecia  Canada   Fuente    Score
0       1       3   Unidos  1705.76
1       1       1  Mas uno  1340.24
2       1       1  Mas uno  1720.99
3       1       1  Mas uno  1264.09
4       1       1  Mas uno   959.49

You can also modify multiple values simultaneously. For instance, if you wish to change the values on the third and fourth lines, you need to use the following code.

In [11]:
dg2.loc[[3, 4], "Score"] = [1111, 2222]

In [12]:
dg2.head()

   Grecia  Canada   Fuente    Score
0       1       3   Unidos  1705.76
1       1       1  Mas uno  1340.24
2       1       1  Mas uno  1720.99
3       1       1  Mas uno  1111.00
4       1       1  Mas uno  2222.00

## Case I

In [22]:
rainfall = pd.DataFrame(data={"City 1": [300.1, 100.2],
"City 2": [400.3, 300.4],
"City 3": [1000.5, 1100.6]})

In [25]:
rainfall2 = rainfall.copy()

In [26]:
rainfall2[rainfall2 < 400] = 0

In [27]:
rainfall2.head()

   City 1  City 2  City 3
0     0.0   400.3  1000.5
1     0.0     0.0  1100.6

## Case II

In this case, we wish to replace the string *Mas uno* by **UNO MÁS**

In [30]:
dg2.replace("Mas uno", "UNO MÁS")

     Grecia  Canada       Fuente    Score
0         1       3       Unidos  1705.76
1         1       1      UNO MÁS  1340.24
2         1       1      UNO MÁS  1720.99
3         1       1      UNO MÁS  1111.00
4         1       1      UNO MÁS  2222.00
..      ...     ...          ...      ...
495       2       2      UNO MÁS  1203.17
496       1       3  Se mantiene  1660.07
497       1       3  Se mantiene  1675.30
498       1       1      UNO MÁS  1644.84
499       1       1      UNO MÁS  1812.37

[500 rows x 4 columns]

# Missing Data_ Pag 100

In [4]:
data=[["Mark", 55, "Italy", 4.5, "Europe"],
["John", 33, "USA", 6.7, "America"],
["Tim", 41, "USA", 3.9, "America"],
["Jenny", 12, "Germany", 9.0, "Europe"]]
df = pd.DataFrame(data=data,
columns=["name", "age", "country",
"score", "continent"],
index=[1001, 1000, 1002, 1003])

In [5]:
df.head()

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

In [6]:
df2 = df.copy() # Let's start with a fresh copy
df2.loc[1000, "score"] = None
df2.loc[1003, :] = None
df2

      name   age country  score continent
1001  Mark  55.0   Italy    4.5    Europe
1000  John  33.0     USA    NaN   America
1002   Tim  41.0     USA    3.9   America
1003  None   NaN    None    NaN      None

* remove rows with missing data

In [7]:
df2.dropna()

      name   age country  score continent
1001  Mark  55.0   Italy    4.5    Europe
1002   Tim  41.0     USA    3.9   America

If, however, you only want to remove rows where all values are missing, use the how parameter:

In [8]:
df2.dropna(how="all")

      name   age country  score continent
1001  Mark  55.0   Italy    4.5    Europe
1000  John  33.0     USA    NaN   America
1002   Tim  41.0     USA    3.9   America

To fill missing values, use fillna. For example, to replace NaN in the score column with its mean

In [9]:
df2.fillna({"score": df2["score"].mean()})

      name   age country  score continent
1001  Mark  55.0   Italy    4.5    Europe
1000  John  33.0     USA    4.2   America
1002   Tim  41.0     USA    3.9   America
1003  None   NaN    None    4.2      None

# Duplicate Data Pag 102

# Filter dataframe

To filter one condition, we apply the following code

In [20]:
Grecia_A = dg[dg["Grecia"] == 2]

In [21]:
Grecia_A.head()

    Grecia  Canada    Fuente    Score
6        2       1  Suma Dos  1842.83
7        2       1  Suma Dos  1736.22
11       2       3   Mas uno  1675.30
22       2       1  Suma Dos  1157.48
23       2       1  Suma Dos  1172.71